###################################################################

# Created by write_sdc on Tue Mar 18 02:59:27 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_load -pin_load 1 [get_ports busy]
set_load -pin_load 1 [get_ports {iaddr[11]}]
set_load -pin_load 1 [get_ports {iaddr[10]}]
set_load -pin_load 1 [get_ports {iaddr[9]}]
set_load -pin_load 1 [get_ports {iaddr[8]}]
set_load -pin_load 1 [get_ports {iaddr[7]}]
set_load -pin_load 1 [get_ports {iaddr[6]}]
set_load -pin_load 1 [get_ports {iaddr[5]}]
set_load -pin_load 1 [get_ports {iaddr[4]}]
set_load -pin_load 1 [get_ports {iaddr[3]}]
set_load -pin_load 1 [get_ports {iaddr[2]}]
set_load -pin_load 1 [get_ports {iaddr[1]}]
set_load -pin_load 1 [get_ports {iaddr[0]}]
set_load -pin_load 1 [get_ports cwr]
set_load -pin_load 1 [get_ports {caddr_wr[11]}]
set_load -pin_load 1 [get_ports {caddr_wr[10]}]
set_load -pin_load 1 [get_ports {caddr_wr[9]}]
set_load -pin_load 1 [get_ports {caddr_wr[8]}]
set_load -pin_load 1 [get_ports {caddr_wr[7]}]
set_load -pin_load 1 [get_ports {caddr_wr[6]}]
set_load -pin_load 1 [get_ports {caddr_wr[5]}]
set_load -pin_load 1 [get_ports {caddr_wr[4]}]
set_load -pin_load 1 [get_ports {caddr_wr[3]}]
set_load -pin_load 1 [get_ports {caddr_wr[2]}]
set_load -pin_load 1 [get_ports {caddr_wr[1]}]
set_load -pin_load 1 [get_ports {caddr_wr[0]}]
set_load -pin_load 1 [get_ports {cdata_wr[19]}]
set_load -pin_load 1 [get_ports {cdata_wr[18]}]
set_load -pin_load 1 [get_ports {cdata_wr[17]}]
set_load -pin_load 1 [get_ports {cdata_wr[16]}]
set_load -pin_load 1 [get_ports {cdata_wr[15]}]
set_load -pin_load 1 [get_ports {cdata_wr[14]}]
set_load -pin_load 1 [get_ports {cdata_wr[13]}]
set_load -pin_load 1 [get_ports {cdata_wr[12]}]
set_load -pin_load 1 [get_ports {cdata_wr[11]}]
set_load -pin_load 1 [get_ports {cdata_wr[10]}]
set_load -pin_load 1 [get_ports {cdata_wr[9]}]
set_load -pin_load 1 [get_ports {cdata_wr[8]}]
set_load -pin_load 1 [get_ports {cdata_wr[7]}]
set_load -pin_load 1 [get_ports {cdata_wr[6]}]
set_load -pin_load 1 [get_ports {cdata_wr[5]}]
set_load -pin_load 1 [get_ports {cdata_wr[4]}]
set_load -pin_load 1 [get_ports {cdata_wr[3]}]
set_load -pin_load 1 [get_ports {cdata_wr[2]}]
set_load -pin_load 1 [get_ports {cdata_wr[1]}]
set_load -pin_load 1 [get_ports {cdata_wr[0]}]
set_load -pin_load 1 [get_ports crd]
set_load -pin_load 1 [get_ports {caddr_rd[11]}]
set_load -pin_load 1 [get_ports {caddr_rd[10]}]
set_load -pin_load 1 [get_ports {caddr_rd[9]}]
set_load -pin_load 1 [get_ports {caddr_rd[8]}]
set_load -pin_load 1 [get_ports {caddr_rd[7]}]
set_load -pin_load 1 [get_ports {caddr_rd[6]}]
set_load -pin_load 1 [get_ports {caddr_rd[5]}]
set_load -pin_load 1 [get_ports {caddr_rd[4]}]
set_load -pin_load 1 [get_ports {caddr_rd[3]}]
set_load -pin_load 1 [get_ports {caddr_rd[2]}]
set_load -pin_load 1 [get_ports {caddr_rd[1]}]
set_load -pin_load 1 [get_ports {caddr_rd[0]}]
set_load -pin_load 1 [get_ports {csel[2]}]
set_load -pin_load 1 [get_ports {csel[1]}]
set_load -pin_load 1 [get_ports {csel[0]}]
set_max_fanout 20 [get_ports clk]
set_max_fanout 20 [get_ports reset]
set_max_fanout 20 [get_ports ready]
set_max_fanout 20 [get_ports {idata[19]}]
set_max_fanout 20 [get_ports {idata[18]}]
set_max_fanout 20 [get_ports {idata[17]}]
set_max_fanout 20 [get_ports {idata[16]}]
set_max_fanout 20 [get_ports {idata[15]}]
set_max_fanout 20 [get_ports {idata[14]}]
set_max_fanout 20 [get_ports {idata[13]}]
set_max_fanout 20 [get_ports {idata[12]}]
set_max_fanout 20 [get_ports {idata[11]}]
set_max_fanout 20 [get_ports {idata[10]}]
set_max_fanout 20 [get_ports {idata[9]}]
set_max_fanout 20 [get_ports {idata[8]}]
set_max_fanout 20 [get_ports {idata[7]}]
set_max_fanout 20 [get_ports {idata[6]}]
set_max_fanout 20 [get_ports {idata[5]}]
set_max_fanout 20 [get_ports {idata[4]}]
set_max_fanout 20 [get_ports {idata[3]}]
set_max_fanout 20 [get_ports {idata[2]}]
set_max_fanout 20 [get_ports {idata[1]}]
set_max_fanout 20 [get_ports {idata[0]}]
set_max_fanout 20 [get_ports {cdata_rd[19]}]
set_max_fanout 20 [get_ports {cdata_rd[18]}]
set_max_fanout 20 [get_ports {cdata_rd[17]}]
set_max_fanout 20 [get_ports {cdata_rd[16]}]
set_max_fanout 20 [get_ports {cdata_rd[15]}]
set_max_fanout 20 [get_ports {cdata_rd[14]}]
set_max_fanout 20 [get_ports {cdata_rd[13]}]
set_max_fanout 20 [get_ports {cdata_rd[12]}]
set_max_fanout 20 [get_ports {cdata_rd[11]}]
set_max_fanout 20 [get_ports {cdata_rd[10]}]
set_max_fanout 20 [get_ports {cdata_rd[9]}]
set_max_fanout 20 [get_ports {cdata_rd[8]}]
set_max_fanout 20 [get_ports {cdata_rd[7]}]
set_max_fanout 20 [get_ports {cdata_rd[6]}]
set_max_fanout 20 [get_ports {cdata_rd[5]}]
set_max_fanout 20 [get_ports {cdata_rd[4]}]
set_max_fanout 20 [get_ports {cdata_rd[3]}]
set_max_fanout 20 [get_ports {cdata_rd[2]}]
set_max_fanout 20 [get_ports {cdata_rd[1]}]
set_max_fanout 20 [get_ports {cdata_rd[0]}]
set_drive 0.1  [get_ports clk]
set_drive 0.1  [get_ports reset]
set_drive 0.1  [get_ports ready]
set_drive 0.1  [get_ports {idata[19]}]
set_drive 0.1  [get_ports {idata[18]}]
set_drive 0.1  [get_ports {idata[17]}]
set_drive 0.1  [get_ports {idata[16]}]
set_drive 0.1  [get_ports {idata[15]}]
set_drive 0.1  [get_ports {idata[14]}]
set_drive 0.1  [get_ports {idata[13]}]
set_drive 0.1  [get_ports {idata[12]}]
set_drive 0.1  [get_ports {idata[11]}]
set_drive 0.1  [get_ports {idata[10]}]
set_drive 0.1  [get_ports {idata[9]}]
set_drive 0.1  [get_ports {idata[8]}]
set_drive 0.1  [get_ports {idata[7]}]
set_drive 0.1  [get_ports {idata[6]}]
set_drive 0.1  [get_ports {idata[5]}]
set_drive 0.1  [get_ports {idata[4]}]
set_drive 0.1  [get_ports {idata[3]}]
set_drive 0.1  [get_ports {idata[2]}]
set_drive 0.1  [get_ports {idata[1]}]
set_drive 0.1  [get_ports {idata[0]}]
set_drive 0.1  [get_ports {cdata_rd[19]}]
set_drive 0.1  [get_ports {cdata_rd[18]}]
set_drive 0.1  [get_ports {cdata_rd[17]}]
set_drive 0.1  [get_ports {cdata_rd[16]}]
set_drive 0.1  [get_ports {cdata_rd[15]}]
set_drive 0.1  [get_ports {cdata_rd[14]}]
set_drive 0.1  [get_ports {cdata_rd[13]}]
set_drive 0.1  [get_ports {cdata_rd[12]}]
set_drive 0.1  [get_ports {cdata_rd[11]}]
set_drive 0.1  [get_ports {cdata_rd[10]}]
set_drive 0.1  [get_ports {cdata_rd[9]}]
set_drive 0.1  [get_ports {cdata_rd[8]}]
set_drive 0.1  [get_ports {cdata_rd[7]}]
set_drive 0.1  [get_ports {cdata_rd[6]}]
set_drive 0.1  [get_ports {cdata_rd[5]}]
set_drive 0.1  [get_ports {cdata_rd[4]}]
set_drive 0.1  [get_ports {cdata_rd[3]}]
set_drive 0.1  [get_ports {cdata_rd[2]}]
set_drive 0.1  [get_ports {cdata_rd[1]}]
set_drive 0.1  [get_ports {cdata_rd[0]}]
